posts/release-to-qa-not-production/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Rebeja · Don't release to Production, release to QA </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700%7CAbril+Fatface">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/fork-awesome@1.1.7/css/fork-awesome.min.css" integrity="sha256-gsmEoJAws/Kd3CjuOQzLie5Q3yshhvmo7YNtBG7aaEY=" crossorigin="anonymous">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://rebeja.eu/posts/release-to-qa-not-production/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Petru Rebeja">
<link rel="prev" href="../separate-tools-from-domain/" title="Keep the tools separate from the domain of your application" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <div class="hsidebar">
        <div class="container sidebar-sticky">
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../index.html" title="Home"><i class="fa fa-home"></i>Home</a>
            <a class="sidebar-nav-item" href="../../archive.html" title="Archive"><i class="fa fa-folder-open"></i>Archive</a>
            <a class="sidebar-nav-item" href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i>Tags</a>
            <a class="sidebar-nav-item" href="../welcome/" title="About"><i class="fa fa-user"></i>About</a>
            <a class="sidebar-nav-item" href="../../rss.xml" title="RSS"><i class="fa fa-feed"></i>RSS</a>
            <a class="sidebar-nav-item" href="../../pages/en-ro-dictionary-for-ai" title="Dicţionar EN-RO pentru IA"><i class="fa fa-book"></i>Dicţionar EN-RO pentru IA</a>
            <a class="sidebar-nav-item" href="https://twitter.com/petrurebeja" title="My Twitter"><i class="fa fa-twitter"></i>My Twitter</a>
            <a class="sidebar-nav-item" href="https://github.com/RePierre" title="My Github"><i class="fa fa-github"></i>My Github</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2022         <a href="mailto:petru.rebeja@gmail.com">Petru Rebeja</a> - Powered by   <a href="https://www.gnu.org/software/emacs/" rel="nofollow">GNU Emacs</a>  &amp;    <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>
    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Don't release to Production, release to QA</a></h1>

    <p class="dateline">
      <i class="fa fa-clock-o"></i> <time class="published dt-published" datetime="2022-11-29T14:14:25+02:00" itemprop="datePublished" title="2022-11-29 14:14">2022-11-29 14:14</time>   |   <i class="fa fa-user"></i> 
         Petru Rebeja
      
      
    </p>
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <p>
<b>Automate your release workflow to such extent that the QA engineers from your team become the users of the application.</b>
</p>

<div id="outline-container-org64eb0f8" class="outline-2">
<h2 id="org64eb0f8">Introduction</h2>
<div class="outline-text-2" id="text-org64eb0f8">
<p>
It's Friday afternoon, the end of the sprint, and a few hours before the weekend starts, and the QA engineers are performing the required tests on the last Sprint Backlog Item (SBI). The developer responsible for that item, confident that the SBI meets all acceptance criteria, is already in the weekend mood.
</p>

<p>
Suddenly, a notification pops up — there is an issue with the feature being tested. The developer jumps on it to see what the problem is, and after discussing with the QA engineer he/she finds out that the issue is caused by some leftover data from the previous SBI.
</p>

<p>
Having identified the problem, the developer spends a few minutes to craft a SQL script that will clean the data, and gives it to the QA engineer. The QA engineer runs the script on the QA database, starts testing the SBI from the beginning, and then confirms that the system is "back to normal".
</p>

<p>
Both sigh in relief while the SBI is marked as "Done" and the weekend starts. Bliss!
</p>
</div>
</div>

<div id="outline-container-orgf744534" class="outline-2">
<h2 id="orgf744534">Getting to the root problem</h2>
<div class="outline-text-2" id="text-orgf744534">
<p>
Although the day and the sprint goal were saved, I would argue that applying the cleanup script just fixed an issue but left the root problem untouched. And to get to the root problem, let's take a closer look on what happened.
</p>

<p>
The database issue stems from the fact that instead of being kept as close as possible to production data (as the best practices suggest) the database grew to become an entity of its own through not being kept tidy by the team.
</p>

<p>
When testing a SBI involves changing some of the data from the database, it is not very often that those changes are reverted as soon as the SBI leaves the QA environment. With each such change the two databases (production and QA) grow further and further apart, and the probability of having to apply a workaround script increases each time. However  the paradox is that the cleanup script, although it solves the issue, is <i>yet another change to the data</i> which widens even more the gap between QA and production databases.
</p>

<p>
And there lies our problem: not within the workaround script itself, but within the practice of applying workarounds to patch the proverbial broken pipes instead of building actual deployment pipelines.
</p>

<p>
But this problem goes one level deeper; sure, we can fix the problem at hand by restoring the database from a production backup but to solve the issue once and for all we need to change how we look at QA environment.
</p>

<p>
But our root-cause analysis is not complete yet. We can't just say "let's never apply workarounds" because workarounds are some sort of necessary evil. Let's look at why that is, shall we?
</p>
</div>
</div>

<div id="outline-container-orgedd9a05" class="outline-2">
<h2 id="orgedd9a05">Why and when do we apply workarounds in production?</h2>
<div class="outline-text-2" id="text-orgedd9a05">
<p>
In Production environment a workaround is applied <i>only in critical situations</i> due to high risk of breaking the running system by making ad-hoc changes to it.
</p>

<p>
Unlike the QA environment where, when the system breaks only a few users are affected — namely the QA engineers, when the system halts in Production the costs of the downtime are much, much higher. An improper or forgotten <code>where</code> condition in a delete script which wipes out whole tables of data, and renders the system unusable, in the happiest case will lead only to frustrated customers that can't use the thing they paid for.
</p>

<p>
As such, in every critical situation first and foremost comes the assessment: is a workaround really needed?
</p>

<p>
When the answer is yes (i.e., there is no other way of fixing the issue now), then <i>usually</i> there are some procedures to follow. Sticking with the database script example, the minimal procedure would be to:
</p>
<ol class="org-ol">
<li>create the workaround script,</li>
<li>have that script <i>reviewed and approved by at least one additional person</i>, and</li>
<li>have the script executed on Production by someone with proper access rights.</li>
</ol>
<p>
OK, now we're settled: workarounds are necessary <i>in critical situations</i>, and are applied after <i>assessment</i>, <i>review</i>, and <i>approval</i>. Then, going back to our story, the following question arises:
</p>
</div>
</div>

<div id="outline-container-orgead6bb1" class="outline-2">
<h2 id="orgead6bb1">Why do we apply workarounds in QA environment?</h2>
<div class="outline-text-2" id="text-orgead6bb1">
<p>
QA environment is isolated from Production environment, and by definition it has way fewer users. Furthermore, those users have a lot of technical knowledge of how the system runs, and always have something else to do (like designing/writing test cases) while the system is being brought to normal again.
</p>

<p>
Looking from this point of view, there is almost never a <i>critical</i> situation that would require applying a workaround in QA environment.
</p>

<p>
Sure, missing the sprint goal may seem like a critical situation because commitments are important. But on the other hand, and going back to our example — if we're applying a workaround in QA just to promote some feature towards Production, are we <i>really</i> sure that the feature is ready?
</p>

<p>
Now that the assessment of criticality is done, let's get back to our topic and ask:
</p>
</div>
</div>
