posts/release-to-qa-not-production.org
* What if we treated QA environment like Production?

  Production and QA environments are different (/very/ different I may add); there's no doubt about that. What makes them different, from the point of view of our topic, is the fact that when a feature is deployed in Production environment, /all/ the prerequisites are known, and all preliminary steps are executed.

  On the other hand, when deploying to QA environment we don't always have this knowledge, nor do we have all the preliminary steps completed at all times. Furthermore, deploying on QA may require additional steps than on Production, e.g.: restoring the database to the last backup from Production, data anonymization etc.

  But the difference between the number of unknowns can be compensated by the difference between number of deployments, and the fact that a failure in QA environment is not critical. In other words, what we lack in knowledge when deploying to QA environment can be compensated by multiple deployment trials, where each deployment trial gets closer and closer to success.

  And when it comes to doing repetitive tasks...

* Automation is key

  To alleviate the difference between (successive) environments you only need to do one thing, although I must say from the start that achieving that one thing /can be really hard/ --- *automate everything*.

  If a release workflow is properly (read /fully/) automated, then the difference between various environments is reduced mainly to:
  - The group of people who have proper access rights to run the workflow on the specific environment. With today's' tools on the market the difference becomes simplified further --- it is in the group of people that are allowed to see or to push the "Deploy" button.
  - The number and order of "Deploy" buttons a person has to push for the deploy to succeed.

  Although we strive to have our environments behave all the same, they are still inherently different. As such, it goes without saying that not everyone may have rights to deploy to Production, and --- due to some constraints --- on some environment there may be additional actions required to deploy. Nonetheless, the objective remains the same: /avoid manual intervention as much as possible/.

* The Snowball Effect

  Once achieved, the effects of this objective of having minimal manual intervention ripple through and start a [[https://en.wikipedia.org/wiki/Snowball_effect][snowball effect]].

** Efficiency

  At first, you gain efficiency --- there is no checklist to go through when deploying, no time needed to spend doing the tedious steps of deployment; the computers will perform those steps as quickly as possible and /always/ in the same order without skipping any of them or making the errors that humans usually do when performing tedious work.

  With a click of a button, or on a certain event the deployment starts and while it runs the people from the team are free to do whatever they want in the time it takes to deploy: they can have a cup of coffee, can make small talk with a colleague, or can mind the more important business like the overall quality of the product they're working on.

** Speed

  Furthermore, besides efficiency you can gain speed --- just by delegating the deployment process to computers you gain time because computers do boring stuff a lot quicker than humans.

  With efficiency and speed comes reduced [[https://martinfowler.com/articles/branching-patterns.html#integration-friction][integration friction]]. A common effect of reduced integration friction is an increase in integration frequency. High integration frequency coupled with workflow automation leads to an increase in the number of deployments that are made.

  And this is where the magic unravels.

** Tight feedback loop

   Once you automate the repetitive tasks you free-up the time of the QA engineer, which allows him/her to spend more time with the system(s) they are testing. In other words, the time gained through workflow automation is invested into the actual Quality Assurance of the system under test.

   And when the QA engineer invests more time into the testing process, he/she will be able to spot more issues. With enough repetitions enabled by quick deployments, the QA engineer acquires a certain amount of skills which will enable him/her to spot defects faster. The sooner a defect is spotted, the sooner it is reported, and subsequently, the sooner it gets fixed.

   We have a name for this thing --- it's called a /feedback loop/. The feedback loop is not introduced by automation --- it was long present in the project, but once workflow automation is introduced it tightens the feedback loop, which means we, as developers, have to wait less time to see the effects of the changes we introduced into the system. In our specific case, we have to wait less because workflow automation reduces the time of the deployment to QA environment to minimum.

** Improved user experience

   But wait, there's more! The time that the QA engineer gets to invest into growing his/her skills is spent using the system under test. With more time spent using the system under test, the QA engineer gets closer and closer to the mindset of the real users of the system. And while in this mindset, the QA engineer not only understands what the system does for the user but also understands what the user wants to do.

   Of course, this understanding is bound by a certain maximum but nonetheless, the effect it has on the development process is enormous.

   First and foremost, there is an increase in the quality of the system: when the QA engineers have a sound understanding of what the user wants to do they will make sure that the system indeed caters to the needs of its users. This in itself is a huge win for the users alone but this also benefits the entire team --- the knowledge about the system gets disseminated within the whole team (including developers), and the Product Owner (PO) is not  the bottleneck anymore.

   Furthermore, with more time spent in the mindset of a user, the QA engineer will start striving for an improved user experience because he/she, like the real users of the system, will strive to do thing faster.

   As such, the QA engineer starts suggesting some usability improvements of the system. These improvements are small --- e.g., change the order of the menu items, add the ability to have custom shortcuts on the homepage etc, but they do improve the experience of the user.

   Sure, all of those changes must be  discussed with the team /and/ approved by the PO but those who get approved bring the system closer to what the /actual users/ want.

