posts/release-to-qa-not-production/index.html

<div id="outline-container-orgf6d10d6" class="outline-2">
<h2 id="orgf6d10d6">What if we treated QA environment like Production?</h2>
<div class="outline-text-2" id="text-orgf6d10d6">
<p>
Production and QA environments are different (<i>very</i> different I may add); there's no doubt about that. What makes them different, from the point of view of our topic, is the fact that when a feature is deployed in Production environment, <i>all</i> the prerequisites are known, and all preliminary steps are executed.
</p>

<p>
On the other hand, when deploying to QA environment we don't always have this knowledge, nor do we have all the preliminary steps completed at all times. Furthermore, deploying on QA may require additional steps than on Production, e.g.: restoring the database to the last backup from Production, data anonymization etc.
</p>

<p>
But the difference between the number of unknowns can be compensated by the difference between number of deployments, and the fact that a failure in QA environment is not critical. In other words, what we lack in knowledge when deploying to QA environment can be compensated by multiple deployment trials, where each deployment trial gets closer and closer to success.
</p>

<p>
And when it comes to doing repetitive tasks…
</p>
</div>
</div>

<div id="outline-container-org9977484" class="outline-2">
<h2 id="org9977484">Automation is key</h2>
<div class="outline-text-2" id="text-org9977484">
<p>
To alleviate the difference between (successive) environments you only need to do one thing, although I must say from the start that achieving that one thing <i>can be really hard</i> — <b>automate everything</b>.
</p>

<p>
If a release workflow is properly (read <i>fully</i>) automated, then the difference between various environments is reduced mainly to:
</p>
<ul class="org-ul">
<li>The group of people who have proper access rights to run the workflow on the specific environment. With today's' tools on the market the difference becomes simplified further — it is in the group of people that are allowed to see or to push the "Deploy" button.</li>
<li>The number and order of "Deploy" buttons a person has to push for the deploy to succeed.</li>
</ul>
<p>
Although we strive to have our environments behave all the same, they are still inherently different. As such, it goes without saying that not everyone may have rights to deploy to Production, and — due to some constraints — on some environment there may be additional actions required to deploy. Nonetheless, the objective remains the same: <i>avoid manual intervention as much as possible</i>.
</p>
</div>
</div>

<div id="outline-container-org9eb5e69" class="outline-2">
<h2 id="org9eb5e69">The Snowball Effect</h2>
<div class="outline-text-2" id="text-org9eb5e69">
<p>
Once achieved, the effects of this objective of having minimal manual intervention ripple through and start a <a href="https://en.wikipedia.org/wiki/Snowball_effect">snowball effect</a>.
</p>
</div>

<div id="outline-container-org9721ba7" class="outline-3">
<h3 id="org9721ba7">Efficiency</h3>
<div class="outline-text-3" id="text-org9721ba7">
<p>
At first, you gain efficiency — there is no checklist to go through when deploying, no time needed to spend doing the tedious steps of deployment; the computers will perform those steps as quickly as possible and <i>always</i> in the same order without skipping any of them or making the errors that humans usually do when performing tedious work.
</p>

<p>
With a click of a button, or on a certain event the deployment starts and while it runs the people from the team are free to do whatever they want in the time it takes to deploy: they can have a cup of coffee, can make small talk with a colleague, or can mind the more important business like the overall quality of the product they're working on.
</p>
</div>
</div>

<div id="outline-container-org76c64ea" class="outline-3">
<h3 id="org76c64ea">Speed</h3>
<div class="outline-text-3" id="text-org76c64ea">
<p>
Furthermore, besides efficiency you can gain speed — just by delegating the deployment process to computers you gain time because computers do boring stuff a lot quicker than humans.
</p>

<p>
With efficiency and speed comes reduced <a href="https://martinfowler.com/articles/branching-patterns.html#integration-friction">integration friction</a>. A common effect of reduced integration friction is an increase in integration frequency. High integration frequency coupled with workflow automation leads to an increase in the number of deployments that are made.
</p>

<p>
And this is where the magic unravels.
</p>
</div>
</div>

<div id="outline-container-org90bf8d4" class="outline-3">
<h3 id="org90bf8d4">Tight feedback loop</h3>
<div class="outline-text-3" id="text-org90bf8d4">
<p>
Once you automate the repetitive tasks you free-up the time of the QA engineer, which allows him/her to spend more time with the system(s) they are testing. In other words, the time gained through workflow automation is invested into the actual Quality Assurance of the system under test.
</p>

<p>
And when the QA engineer invests more time into the testing process, he/she will be able to spot more issues. With enough repetitions enabled by quick deployments, the QA engineer acquires a certain amount of skills which will enable him/her to spot defects faster. The sooner a defect is spotted, the sooner it is reported, and subsequently, the sooner it gets fixed.
</p>

<p>
We have a name for this thing — it's called a <i>feedback loop</i>. The feedback loop is not introduced by automation — it was long present in the project, but once workflow automation is introduced it tightens the feedback loop, which means we, as developers, have to wait less time to see the effects of the changes we introduced into the system. In our specific case, we have to wait less because workflow automation reduces the time of the deployment to QA environment to minimum.
</p>
</div>
</div>

<div id="outline-container-orgf030374" class="outline-3">
<h3 id="orgf030374">Improved user experience</h3>
<div class="outline-text-3" id="text-orgf030374">
<p>
But wait, there's more! The time that the QA engineer gets to invest into growing his/her skills is spent using the system under test. With more time spent using the system under test, the QA engineer gets closer and closer to the mindset of the real users of the system. And while in this mindset, the QA engineer not only understands what the system does for the user but also understands what the user wants to do.
</p>

<p>
Of course, this understanding is bound by a certain maximum but nonetheless, the effect it has on the development process is enormous.
</p>

<p>
First and foremost, there is an increase in the quality of the system: when the QA engineers have a sound understanding of what the user wants to do they will make sure that the system indeed caters to the needs of its users. This in itself is a huge win for the users alone but this also benefits the entire team — the knowledge about the system gets disseminated within the whole team (including developers), and the Product Owner (PO) is not  the bottleneck anymore.
</p>

<p>
Furthermore, with more time spent in the mindset of a user, the QA engineer will start striving for an improved user experience because he/she, like the real users of the system, will strive to do thing faster.
</p>

<p>
As such, the QA engineer starts suggesting some usability improvements of the system. These improvements are small — e.g., change the order of the menu items, add the ability to have custom shortcuts on the homepage etc, but they do improve the experience of the user.
</p>

<p>
Sure, all of those changes must be  discussed with the team <i>and</i> approved by the PO but those who get approved bring the system closer to what the <i>actual users</i> want.
</p>
</div>
</div>
</div>
